artillery2.yml
config:
  target: 'http://localhost:3043'
  phases:
    - duration: 60
      arrivalCount: 13500
      name: "Sandbox"
    # - duration: 30
    #   arrivalCount: 5000
    #   name: "Sustain max load test"
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - post:
        url: "/api/photos"
        json:
            "id": 10000001
            "image0": "https://photo-gallery-service.s3.amazonaws.com/0.jpeg"
            "image1": "https://photo-gallery-service.s3.amazonaws.com/1.jpeg"
            "image2": "https://photo-gallery-service.s3.amazonaws.com/2.jpeg"
            "image3": "https://photo-gallery-service.s3.amazonaws.com/3.jpeg"
            "image4": "https://photo-gallery-service.s3.amazonaws.com/4.jpeg"
            "image5": "https://photo-gallery-service.s3.amazonaws.com/5.jpeg"
            "image6": "https://photo-gallery-service.s3.amazonaws.com/6.jpeg"
            "image7": "https://photo-gallery-service.s3.amazonaws.com/7.jpeg"
            "image8": "https://photo-gallery-service.s3.amazonaws.com/8.jpeg"
            "image9": "https://photo-gallery-service.s3.amazonaws.com/9.jpeg"
            "image10": "https://photo-gallery-service.s3.amazonaws.com/10.jpeg"
            "image11": "https://photo-gallery-service.s3.amazonaws.com/11.jpeg"
            "image12": "https://photo-gallery-service.s3.amazonaws.com/12.jpeg"
            "image13": "https://photo-gallery-service.s3.amazonaws.com/13.jpeg"
            "image14": "https://photo-gallery-service.s3.amazonaws.com/14.jpeg"
            "date": "October 6-2021"